{
    "reviews_count": 42,
    "reviews": [
        {
            "title": "-Rep customer service",
            "body": "Prices are good, but customer service and shipping are terrible. I had issues with an order and haven't received a response for over a month. Additionally, I asked a question about an item, and three months later, they asked me, \"How would you rate the support you received?\" without ever replying to my initial query.",
            "rating": 1,
            "reviewer": "Rasmus"
        },
        {
            "title": "i dont know why the reviews are so bad…",
            "body": "i dont know why the reviews are so bad on this website i ordered and they came less than two weeks after which is perfect for delivering parts the parts were also in great condition and i got exactly what i wanted i definitely recommend this website and i hope these reviews don't put you off i'm about to order again because i wasn't expecting it to be that good.",
            "rating": 5,
            "reviewer": "Moon Aaron"
        },
        {
            "title": "sites has wrong fotos",
            "body": "orderd a wr96cc cilinder. on the website it showed a water port on the side of the cilinder when recieving the package i noticed 2 things. the box was completely destroyed. (probably because they didn't secure the inside of the package. The cilinder i bought didnt look like the 1 of the site. custommer support said they couldn't do something about it. I tried to contact custommer support the reply they gave me was a coppy of the specs of the cilinder nothing more",
            "rating": 1,
            "reviewer": "jurgen de bruin"
        },
        {
            "title": "I don't recommend Maxiscoot",
            "body": "I don't recommend Maxiscoot! I placed an order last month and they still do not dispatched the parts. I am waiting 3 week since then. They don't answer the emails or picking the phone to give me explanation for what is going on.",
            "rating": 1,
            "reviewer": "Мартин Гецов"
        },
        {
            "title": "never order from this company",
            "body": "never order from this company! i placed an order on their site last mont and refunded it a couple days later becouse the parts came in stock at my local shop and maxiscoot still has not refunded me the money from my cancelled order and they wont answer any of the emails ive sent and nobody hasnt been able to speak to me on the phone when i have called (during business hours)",
            "rating": 1,
            "reviewer": "Luka Tapio"
        },
        {
            "title": "After 2 weeks I have not received my…",
            "body": "After 2 weeks I have not received my stuff. No trace number given. Tried to mail 3 times and not given any respond other than a confirmation mail that they will answer within 24-72 hours. It’s been much more than that. Tried calling but it doesn’t work. Payed ca 400 euro for this. I really hope they contact me or get me my stuff very soon and I’ll perhaps give them 3 stars.",
            "rating": 1,
            "reviewer": "Jimmie"
        },
        {
            "title": "Good site, shame about everything else!",
            "body": "Good looking and easy to use website, easy payment and that's where the good bits end. I paid on 24th June for parts but had to wait for parts to come Into stock. They were dispatched 7th July. And that's it. Still in Germany, no response to repeated contact so I'm left with no parts and no money as others have been. I'll be trying to get my money back but if anyone else is reading this I'd learn from my error in ignoring all the negative reviews - their after sales service sucks.",
            "rating": 1,
            "reviewer": "Colin King"
        },
        {
            "title": "Paid, no refund or parts",
            "body": "not the very best experience with them.\ni actually had an account, but could not log in. After applying for new password, the password never arrived and i got no email whatsoever. After some thoughts what has happened i figured out, that they had some sort of poor database set up. Nevertheless, I ordered parts for Aprilia rs50 and paid. There was an error at the end, but i got confirmation that payment went through and it deducted 270€ or around $310. Up to this day i received NOTHING. They are replying very slowly over emails and the dont have other useful contacts (viber, whatsapp, signal, telegram). Facebook is not helpful. I just hope they either refund me or send out the parts, so i dont have to involve any lawyers or international conflicts...\n\nUpdate to your replay: already contacted you. But you always let me down. Change my mind and show me the proof how will you refund me.",
            "rating": 1,
            "reviewer": "John Marston"
        },
        {
            "title": "stay away from this website they…",
            "body": "stay away from this website they scammers i ordered one item and its been 2 months now i contact them via email about 3 times but no answers. scammers",
            "rating": 1,
            "reviewer": "DJ Kilom"
        },
        {
            "title": "if you wish an honest and punctual…",
            "body": "if you wish an honest and punctual delivery stay clear of them. after several months they are still postponing parts",
            "rating": 1,
            "reviewer": "buyer"
        },
        {
            "title": "Don't order if you live in the UK parts…",
            "body": "Don't order if you live in the UK parts we're shipped fast but I was met with a £96 gbp charge for vat on parts that already cost £336",
            "rating": 1,
            "reviewer": "Daniel Hales"
        },
        {
            "title": "Just don't bother with these guys",
            "body": "Just don't bother with these guys\n\nThey give you the run arround and don't send your parts or give your money back for a refund\n\nStay clear of these scammers",
            "rating": 1,
            "reviewer": "Codfish Switch Kiteboarding"
        },
        {
            "title": "Thank you very much!",
            "body": "So i did order twice from those guys, first time i ordered stuff more than 400 euros. And the site was like \"130 euros and above is free shipping\", alright..\nI had to pay the shipping i didn't mind 30 euros more. But what bothers me is that it took them 1 month to ship all the stuff, and than i get half of them. I bought a brake cylinder + hose, and i only got the cylinder...\nThought that was a mistake, so i did order a second time the missing and even paid the shipping again, for the stuff from my first order. And what a surprise it took them a month to ship it. The shipping was delayed because they didn't have the stuff in stock. The day i was notified about the stuff being send, they removed the hose from my order again so i just payed the shipping and got some other missing stuff, EXCEPT the hose...and now what if i want the hose i have to pay 30 euro shipping for the third time? And what, are am i going to even get the hose? This guys are a joke!\n0 Customer service!",
            "rating": 1,
            "reviewer": "Ivan Vlahov"
        },
        {
            "title": "Fantastic!",
            "body": "Do not agree with other reviews att all. Plenty of discount codes, super fair prices, free shipping over 120 euros. Delivery on weekends and straight to my door with no extra costs, Delivery has always been within 2 weeks if parts are in stock. Been buying parts from here for over 2 years and always been satisfied. I was shocked to see the other negative reviews since i couldn't even relate on the slightest scale. Customer support has always responded within 48 hours.",
            "rating": 5,
            "reviewer": "Noah Laveno"
        },
        {
            "title": "Amazing scooter parts store",
            "body": "Amazing scooter parts store, ordered plastic fairings for my Piaggio they came safely packaged, also the store left a small gift of stickers! Love it! I recommend ordering if you need parts for your motorcycle, moped, scooter!",
            "rating": 5,
            "reviewer": "Augustas Pudževis"
        },
        {
            "title": "Good",
            "body": "Good, Fast delivery. Nice service+ homepage easy to find your parts to your moped.!!1",
            "rating": 5,
            "reviewer": "sebastian lund stenman"
        },
        {
            "title": "Arrived surprisingly fast (I’m in the…",
            "body": "Arrived surprisingly fast (I’m in the uk) all items were in the package however I emailed before I ordered asking if i would have to pay custom fees and maxiscoot I wouldn’t but I was emailed by ups with and £84 fee before I could receive my goods, I’ve emailed maxiscoot since and have had no response. Good selection of products, decent delivery but poor customer service.",
            "rating": 3,
            "reviewer": "Luke"
        },
        {
            "title": "Recommend maxiscoot and scooter- attack",
            "body": "I like maxiscoot and scooter- attack, i have ordered more than 6 times and all parts i have received and completely okay but i ordered a airsal cylinder and it was broken from the side. I got my money back in less than 1 week. Maxiscoot customer service is really good and pretty fast. My parts are always arriving in 1 week. Germany to Estonia. I do not believe the negative reviews, all shipping things depend on the country where are you from.",
            "rating": 5,
            "reviewer": "Rayan Pardanen"
        },
        {
            "title": "Definetly ordering from here again",
            "body": "Definetly ordering from here again!\nDespite what other comments might say, this site is just something else… Parts for low price, and if you order with UPS (stay away from gls) the parts arrive super fast, my package arrived a day before the estimated delivery date! I got everything i ordered, they even gave me a gift! 100% happy with my purchase!",
            "rating": 5,
            "reviewer": "Abel"
        },
        {
            "title": "Ordered a Yasuni R1 exhaust",
            "body": "Ordered a Yasuni R1 exhaust, didn't come with; springs, flange, screws etc.",
            "rating": 1,
            "reviewer": "Frederik Hansen"
        },
        {
            "title": "The amount of part on website",
            "body": "The amount of part on website are amazing and they got alot good information in before buying, prices are very compatible.\n\nHad one bad experience with customer service and very good experience, so overall I'll rate 4 star",
            "rating": 4,
            "reviewer": "jesper lausten"
        },
        {
            "title": "GREAT COMPANY!",
            "body": "Ordered a 75cc cylinder with a 21mm pwk. I ordered it from sweden on a monday and it arrived exactly a week after. I dont understand all the negative reviews on here. Now all thats left for me to do is put the cylinder and carburator on and im rollin. If i ever need to make a big purchase for my moped i will surely order from Maxiscoot!",
            "rating": 5,
            "reviewer": "Charlie Hahne"
        },
        {
            "title": "Ordered 2 Times",
            "body": "Ordered 2 Times, both Times excellent service from maxiscoot, if u order - don't pick the damn GLS - it's garbage shipping, order with UPS and the parts arrive in a week. Great, dont listen to the comments here, I got everything and for a BANGER price!",
            "rating": 5,
            "reviewer": "Patriks As"
        },
        {
            "title": "A+ seller!!!",
            "body": "A+ support from Gaetan, he gave me everything(even more) I needed and he responded quickly!!! It is true that I had to wait two weeks because one item wasn’t on stock but I got comercial gesture-free item wich was great suprise. Highly recommend!\nSuper support, fast shipping, low prices;)",
            "rating": 5,
            "reviewer": "Delavc"
        },
        {
            "title": "Will definitely buy from here again",
            "body": "Bought a new cylinder, got it home where unfortunately there was a fault in it. I wrote to their customer support and less than 24 hours later they had sent me a new one",
            "rating": 5,
            "reviewer": "Frederik Riis"
        },
        {
            "title": "I had a crankshaft failure and the…",
            "body": "I had a crankshaft failure and the customer support gave me the help like true proffessionals!\nVery good prices, exceptional service and Quick shipping!",
            "rating": 5,
            "reviewer": "Oliver Hammarberg"
        },
        {
            "title": "Bad service",
            "body": "Bad service, slow shipping",
            "rating": 1,
            "reviewer": "Vhepo"
        },
        {
            "title": "Aerox 4 euro 4, best prices on internet!!!!",
            "body": "I have bought items for best price ever MALOSSI CYLINDER 66CC H2O YAMAHA AEROX / NEO'S 4-STROKE EURO 4 227eur MALOSSI CDI INJECTION CONTROL FORCE MASTER 0 YAMAHA AEROX / NEO'S IE 50CC 4-STROKE AFTER 2018 153 eur and POLINI PRIMARY TRANSMISSION 16/51 YAMAHA 50CC 4-STROKE 3V for 64 eur ,shipping 1 week and everything was seald.Best site on internet for scooter parts,I was sceptic at first becouse of bad comments here,just check youtube and facebook and you will se they are legit really im amazed when you order you see best price,but when you go to pay prices drop even more,really good job guys good job!!!",
            "rating": 5,
            "reviewer": "Paolo"
        },
        {
            "title": "I have a great experience with…",
            "body": "I have a great experience with Maxiscoot...get 3 orders till now and everything was great ( delivery time, packaging and the prices are great )",
            "rating": 5,
            "reviewer": "Petar Zigo"
        },
        {
            "title": "Very good communication and fast…",
            "body": "Very good communication and fast shipping. The parts came exactly as they should",
            "rating": 5,
            "reviewer": "customer"
        },
        {
            "title": "Dont get why they get a lot of hate",
            "body": "Dont get why they get a lot of hate, the site is nice, customer service is epic, its cheap, its perfect",
            "rating": 5,
            "reviewer": "snafu s"
        },
        {
            "title": "THE BEST OF THE BEST !!!!",
            "body": "THE BEST OF THE BEST !!!!",
            "rating": 5,
            "reviewer": "Davy Firmery"
        },
        {
            "title": "Perfect! Fast delivery, Good quality, Good price and Good website",
            "body": "Perfect! Fast delivery, Good quality, Good price and Good website.\nHaven't seen any downsides.",
            "rating": 5,
            "reviewer": "HsSwe"
        },
        {
            "title": "Really fast delivery and both the tail…",
            "body": "Really fast delivery and both the tail light and front plastics/lights works perfectly and was nicely packed.",
            "rating": 5,
            "reviewer": "Patrick"
        },
        {
            "title": "Waiting almost 2 months for delivery and had to cancel some items",
            "body": "Ordered 9 different items on 17.08., partially sent through two deliveries (the last one received on 14.10.) and had to cancel the remaining product because I couldn't wait any more.\nTerrible service, the worst I've ever experienced.\nAvoid them if you want to avoid problems.",
            "rating": 1,
            "reviewer": "Dario Gavran"
        },
        {
            "title": "defective goods and zero assistance",
            "body": "",
            "rating": 1,
            "reviewer": "carluz"
        },
        {
            "title": "Great Service and delivery in 1 day",
            "body": "Great Service and delivery in 1 day. I love",
            "rating": 5,
            "reviewer": "Philipp Lorentz"
        },
        {
            "title": "don't buy from him !",
            "body": "don't buy from him !! to avoid",
            "rating": 1,
            "reviewer": "123456789ciaociao"
        },
        {
            "title": "terrible company",
            "body": "",
            "rating": 1,
            "reviewer": "Jöö"
        },
        {
            "title": "Very good and fast chipping",
            "body": "Very good and fast chipping. Cheap parts",
            "rating": 5,
            "reviewer": "Myles"
        },
        {
            "title": "Fast delivery",
            "body": "Fast delivery. No complaints 👍",
            "rating": 5,
            "reviewer": "Sebastian"
        },
        {
            "title": "Great products and multilingual support!",
            "body": "",
            "rating": 5,
            "reviewer": "Johnny Walter Hobson"
        }
    ]
}